package com.mario.common.pattern;

/**
 *
 */
public interface RegPattern {

  /**
   * 平台号
   */
  String PLATFORM_CODE = "1|2|3|9";

  /**
   * 验证UUID 如：1684471a-9ce8-4b14-b054-0a637a0e86b5或1684471a9ce84b14b0540a637a0e86b5 由三十二位数字和字母组成。
   * <p>
   * {8位-4位-4位-4位-12位}
   */
  String UUID = "^[A-Fa-f0-9]{8}(-?[A-Fa-f0-9]{4}){3}-?[A-Fa-f0-9]{12}$";

  String SQL_COUNT_REPLACE = "(?i)order\\s*(?i)BY\\s*.*";

  /**
   * 删除标识
   */
  String ORDER_STATUS = "1|2|3|4|5";

  /**
   * 删除标识
   */
  String DELETE_FLAG = "0|1";

  /**
   * 金额
   */
  String AMOUNT = "^[1-9][0-9]{0,16}$";

  /**
   * 金额
   */
  String FEE = "^[0-9]{1,17}$";

  /**
   * 币种
   */
  String CURRENCY_CODE = "^(?:RMB|USD|HKD|VTL)$";

  /**
   * 验证出生日期（年月日）
   */
  String REG_BIRTH_DAY = "[1-9]{4}([-./])\\d{1,2}\\1\\d{1,2}";

  /**
   * 日期
   */
  String SIMPLE_DATE = "^\\d{4}((0[1-9])|(1[0-2]))(([0-2][0-9])|(3[0-1]))$";

  /**
   * 时间
   */
  String SIMPLE_TIME = "^([0-1][0-9]|[2][0-3])([0-5][0-9]){2}$";

  /**
   * 日期时间 yyyyMMddHHmmss
   */
  String SIMPLE_DATE_TIME = "^\\d{4}((0[1-9])|(1[0-2]))(([0-2][0-9])|(3[0-1]))" + //日期
      "([0-1][0-9]|[2][0-3])([0-5][0-9]){2}$"; //时间

  /**
   * 日期时间 yyyy-MM-dd HH:mm:ss
   */
  String SIMPLE_DATE_TIME_SPLIT = "^\\d{4}-((0[1-9])|(1[0-2]))-(([0-2][0-9])|(3[0-1]))" + //日期
      " ([0-1][0-9]|[2][0-3])(:[0-5][0-9]){2}$"; //时间

  /**
   * 验证日期（年月）
   * <p>
   * 年月，格式：yyyyMM, 如：201602
   */
  String REG_YYYYMM = "^\\d{4}((0[1-9])|(1[0-2]))$";

  /**
   * 验证日期（年月日）
   * <p>
   * 年月，格式：yyyyMMdd, 如：20160210
   */
  String REG_YYYYMMDD = "^\\d{4}((0[1-9])|(1[0-2]))(([0-2][0-9])|(3[0-1]))$";

  /**
   * 验证日期（年月日）
   * <p>
   * 年月，格式：yyyy-MM-dd, 如：2016-02-10
   */
  String REG_YYYY_MM_DD =
      "(([0-9]{3}[1-9]|[0-9]{2}[1-9][0-9]{1}|[0-9]{1}[1-9][0-9]{2}|[1-9][0-9]{3})" +
          "-(((0[13578]|1[02])-(0[1-9]|[12][0-9]|3[01]))|((0[469]|11)-(0[1-9]|[12][0-9]|30))|(02-(0[1-9]|[1][0-9]|2[0-8]))))"
          +
          "|((([0-9]{2})(0[48]|[2468][048]|[13579][26])|((0[48]|[2468][048]|[3579][26])00))-02-29)";

  /**
   * 手机号格式 "(\\+\\d+)?1[34578]\\d{9}$"
   */
  String REG_MOBILE = "^1[34578]\\d{9}$";

  /**
   * email
   */
  String REG_EMAIL = "\\w+@\\w+\\.[a-z]+(\\.[a-z]+)?";

  /**
   * 验证固定电话号码
   *
   * @param phone 电话号码，格式：国家（地区）电话代码 + 区号（城市代码） + 电话号码，如：+8602085588447
   * <p><b>国家（地区） 代码 ：</b>标识电话号码的国家（地区）的标准国家（地区）代码。它包含从 0 到 9 的一位或多位数字，
   * 数字之后是空格分隔的国家（地区）代码。</p>
   * <p><b>区号（城市代码）：</b>这可能包含一个或多个从 0 到 9 的数字，地区或城市代码放在圆括号——
   * 对不使用地区或城市代码的国家（地区），则省略该组件。</p>
   * <p><b>电话号码：</b>这包含从 0 到 9 的一个或多个数字 </p>
   * @return 验证成功返回true，验证失败返回false
   */
  String REG_PHONE = "(\\+\\d+)?(\\d{3,4}\\-?)?\\d{7,8}$";

  /**
   * 验证整数（正整数和负整数）
   */
  String REG_DIGIT = "^[1-9]\\d*|{0}$";
  /**
   * 验证正整数
   */
  String REG_POSITIVE_INTEGER = "^\\+?[1-9][0-9]*$";

  /**
   * 验证整数和浮点数（正负整数和正负浮点数）
   */
  String REG_DECIMALS = "\\-?[1-9]\\d+(\\.\\d+)?";

  /**
   * 验证空白字符
   */
  String REG_BLANK_SPACE = "\\s+";

  /**
   * 验证中文字符
   */
  String REG_CHINESE = "^[\u4E00-\u9FA5]+$";

  /**
   * 验证URL
   */
  String REG_URL = "(https?://(w{3}\\.)?)?\\w+\\.\\w+(\\.[a-zA-Z]+)*(:\\d{1,5})?(/\\w*)*(\\??(.+=.*)?(&.+=.*)?)?";

  /**
   * 获取网址 URL 的一级域名
   */
  String REG_DOMAIN = "(?<=http://|\\.)[^.]*?\\.(com|cn|net|org|biz|info|cc|tv)";

  /**
   * 验证邮编
   */
  String REG_POST_CODE = "[1-9]\\d{5}";

  /**
   * 匹配IP地址(简单匹配，格式，如：192.168.1.1，127.0.0.1，没有匹配IP段的大小)
   */
  String REG_IP_ADDRESS = "[1-9](\\d{1,2})?\\.(0|([1-9](\\d{1,2})?))\\.(0|([1-9](\\d{1,2})?))\\.(0|([1-9](\\d{1,2})?))";

  /**
   * 验证版本号 version 如：1.1、1.1.1
   */
  String REG_VERSION = "^\\d+(\\.\\d+){1,2}$";

  /**
   * 居民身份证号码15位或18位，最后一位可能是数字或字母
   */
  String REG_IDCARD = "[1-9]\\d{13,16}[a-zA-Z0-9]{1}";
  /**
   * 0或者1标识
   */
  String ZERO_OR_ONE = "0|1";
  /**
   * 服务评分取值范围
   */
  String SERVICE_SCORE = "0|1|2|3|4|5";

  /**
   * 验证正整数或者正浮点数
   */
  String REG_POSITIVE_INTEGER_FLOAT = "^[1-9]\\d*\\.\\d*|0\\.\\d*[1-9]\\d*$|^[1-9]\\d*$";
  /**
   * 性别标识
   */
  String GENDER_FLAG = "0|1";
  /**
   * 图片url
   */
  String IMG_URL = "^((https)?://)[^\\s]+";
  /**
   * 验证字母，数字
   */
  String LETTER_DIGIT = "^[A-Za-z0-9]+$";
  /**
   * 验证字母，数字,中文
   */
  String LETTER_DIGIT_CHINESE = "^[a-zA-Z0-9\u4E00-\u9FA5]+$";

  /**
   * 验证邮编(6位数字)
   */
  String ZIP_CODE = "[1-9]\\d{5}(?!\\d)";

  /**
   * 验证正数
   */
  String POSITIVE_NUM = "^[+]?[\\d]+(([\\.]{1}[\\d]+)|([\\d]*))$";
}
